Revit 2027 API
RebarShapeConstraintArcLength Constructor
 Create an arc-length constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraintArcLength(
	ElementId paramId
)
Public Sub New (
	paramId As ElementId
)
public:
RebarShapeConstraintArcLength(
	ElementId^ paramId
)
new :
        paramId : ElementId -> RebarShapeConstraintArcLength
Parameters
paramId ElementId
 The Id of a Rebar Shape parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeConstraintArcLength Class
Autodesk.Revit.DB.Structure Namespace